import telebot
from telebot.types import InlineKeyboardMarkup, InlineKeyboardButton
import random
#@iqq_python - @DzDrD
bot = telebot.TeleBot("6563808120:AAFpAUpbnQDtNtKCDoWd8txQ4Cn5QrWw8JM")
#@iqq_python - @DzDrD
@bot.message_handler(commands=['start'])
def send_welcome(message):
    bot.reply_to(message, """ اهلا بك في هذا البوت 🌹
   لبدء باللعبة ارسل /go
  المطور : @altaee_z
  قناة المطور : @my00002

        """)
QQs = [
    {
        "question": "ما هو اسم أول سورة في القرآن الكريم؟",
        "OPI": ["الفاتحة", "النمل", "البقرة", "يس"],
        "CO": "الفاتحة"
    },
    {
        "question": "كم عدد السور في القرآن الكريم؟",
        "OPI": ["113 سورة", "114 سورة", "115 سورة", "116 سورة"],
        "CO": "114 سورة"
    },
    {
        "question": "في أي سورة يُشار إلى القلب بأنه 'قلب سَلِيم'؟",
        "OPI": ["سورة النمل", "سورة الفاتحة", "سورة يس", "سورة الشرح"],
        "CO": "سورة الشرح"
    },
    {
        "question": "كم عدد الآيات في سورة الفاتحة؟",
        "OPI": ["3 آيات", "5 آيات", "7 آيات", "9 آيات"],
        "CO": "7 آيات"
    },
    {
        "question": "ما هو آخر سورة في القرآن الكريم؟",
        "OPI": ["سورة الناس", "سورة الفيل", "سورة الكوثر", "سورة النمل"],
        "CO": "سورة الناس"
    },
    {
        "question": "ما هو الجزء الذي يحتوي على سورة الكوثر؟",
        "OPI": ["الجزء الثالث", "الجزء الرابع", "الجزء الأول", "الجزء الخامس"],
        "CO": "الجزء الثلاثون"
    },
    {
        "question": "في أي سورة يُشرَّع صيام شهر رمضان؟",
        "OPI": ["سورة النمل", "سورة الفاتحة", "سورة يس", "سورة البقرة"],
        "CO": "سورة البقرة"
    },
    {
        "question": "ما هي عاصمة فرنسا؟",
        "OPI": ["باريس", "لندن", "روما", "برلين"],
        "CO": "باريس"
    },
    {
        "question": "ما هي أكبر بحيرة في العالم؟",
        "OPI": ["بحيرة القرم", "بحيرة فيكتوريا", "بحيرة العين", "بحيرة الأقمار"],
        "CO": "بحيرة القرم"
    },
    {
        "question": "ما هي عاصمة جمهورية مصر العربية؟",
        "OPI": ["القاهرة", "الجيزة", "الإسكندرية", "الإسماعيلية"],
        "CO": "القاهرة"
    },
    {
        "question": "ما هو أكبر سيارة لاند روفر؟",
        "OPI": ["ديسكفري", "رانج روفر", "فيلار", "إيفوك"],
        "CO": "رانج روفر"
    },
    {
        "question": "من هو مؤسس شركة أبل؟",
        "OPI": ["ستيف جوبز", "بيل غيتس", "مارك زوكربيرج", "لاري بايج"],
        "CO": "ستيف جوبز"
    },
    {
        "question": "ما هو أطول نهر في العالم؟",
        "OPI": ["نهر النيل", "نهر الأمازون", "نهر اليانغتسي", "نهر الكونغو"],
        "CO": "نهر النيل"
    },
    {
        "question": "ما هو المعادلة الخطية الأكثر تعقيدًا المعروفة وما هي أهميتها في علم الأعداد؟",
        "OPI": ["معادلة لازانو", "معادلة نفاذة", "معادلة فيرما", "معادلة ريكاتي"],
        "CO": "معادلة لازانو"
    },
    {
        "question": "ما هو مفهوم الأعداد المركبة وكيف يمكن تمثيلها في المستوى الكارتيزيي؟",
        "OPI": ["الأعداد الحقيقية", "الأعداد الأولية", "الأعداد التجميعية", "الأعداد الزوجية"],
        "CO": "الأعداد التجميعية"
    },
    {
        "question": "ما هو مفهوم الأبعاد في الهندسة وكيف يمكن استخدام الأبعاد العالية في الفضاء؟",
        "OPI": ["الأبعاد المنخفضة", "الأبعاد المكعبية", "الأبعاد الهندسية", "الأبعاد العليا"],
        "CO": "الأبعاد العليا"
    },
    {
        "question": "ما هي نظرية الأعداد وكيف يمكن استخدامها في تحليل الأنماط الرياضية المعقدة؟",
        "OPI": ["نظرية الأعداد الأولية", "نظرية الأعداد التجميعية", "نظرية الأعداد الجبرية", "نظرية الأعداد الثنائية"],
        "CO": "نظرية الأعداد الأولية"
    },
    {
        "question": "ما هي مبرهنة غودل وما هو دورها في نظرية الأعداد والمنطق الرياضي؟",
        "OPI": ["مبرهنة جميلة", "مبرهنة عظيمة", "مبرهنة فخرية", "مبرهنة خاصة"],
        "CO": "مبرهنة جميلة"
    },
    {
        "question": "ما هي عملة اليابان؟",
        "OPI": ["الريال", "الدولار", "الين", "اليورو"],
        "CO": "الين"
    },
    {
        "question": "ما هو أكبر كوكب في المجموعة الشمسية؟",
        "OPI": ["زحل", "المشتري", "الأرض", "عطارد"],
        "CO": "المشتري"
    },
    {
        "question": "من هو رسام لوحة الموناليزا الشهيرة؟",
        "OPI": ["ليوناردو دافنشي", "فان جوخ", "بابلو بيكاسو", "ريمبراندت"],
        "CO": "ليوناردو دافنشي"
    },
    {
        "question": "ما هي أكبر دولة في العالم من حيث المساحة؟",
        "OPI": ["كندا", "روسيا", "الصين", "الولايات المتحدة الأمريكية"],
        "CO": "روسيا"
    },
    {
        "question": "من هو مؤسس شركة مايكروسوفت؟",
        "OPI": ["ستيف بالمر", "بيل غيتس", "مارك زوكربيرج", "لاري بايج"],
        "CO": "بيل غيتس"
    },
    {
        "question": "ما هي عاصمة إسبانيا؟",
        "OPI": ["برشلونة", "مدريد", "فالنسيا", "إشبيلية"],
        "CO": "مدريد"
    },
    {
        "question": "ما هي أكبر دولة في أفريقيا من حيث عدد السكان؟",
        "OPI": ["نيجيريا", "جنوب أفريقيا", "الجزائر", "مصر"],
        "CO": "نيجيريا"
    },
    {
        "question": "ما هو أكبر جبل في العالم من حيث الارتفاع؟",
        "OPI": ["جبل إفرست", "جبل كليمنجارو", "جبل فينسون", "جبل ماكينلي"],
        "CO": "جبل إفرست"
    },
    {
        "question": "من هو مؤسس شركة تسلا موتورز؟",
        "OPI": ["جيف بيزوس", "مارك زوكربيرج", "بيل غيتس", "إيلون ماسك"],
        "CO": "إيلون ماسك"
    },
    {
        "question": "ما هي العملة الرسمية لدولة الهند؟",
        "OPI": ["الروبية", "الرنجيت", "الدولار", "الدرهم"],
        "CO": "الروبية"
    },
    {
        "question": "ما هو أكبر قارة في العالم من حيث المساحة؟",
        "OPI": ["أوروبا", "أمريكا الجنوبية", "أفريقيا", "آسيا"],
        "CO": "آسيا"
    },
    {
        "question": "من هو مؤسس شركة فيسبوك؟",
        "OPI": ["بيل غيتس", "مارك زوكربيرج", "ستيف جوبز", "جيف بيزوس"],
        "CO": "مارك زوكربيرج"
    },
    {
        "question": "ما هو أكبر محيط في العالم؟",
        "OPI": ["المحيط الهندي", "المحيط الأطلسي", "المحيط الهادئ", "المحيط القطبي الجنوبي"],
        "CO": "المحيط الهادئ"
    },
    {
        "question": "ما هي عاصمة روسيا؟",
        "OPI": ["موسكو", "سانت بطرسبرغ", "نوفوسيبيرسك", "كازان"],
        "CO": "موسكو"
    },
    {
        "question": "ما هو أكبر حيوان على اليابسة من حيث الحجم؟",
        "OPI": ["فيل الأفريقي", "الزرافة", "الحوت الأزرق", "النمر"],
        "CO": "فيل الأفريقي"
    },
    {
        "question": "ما هي عاصمة إيطاليا؟",
        "OPI": ["ميلانو", "فلورنسا", "روما", "نابولي"],
        "CO": "روما"
    },
    {
        "question": "ما هو المبدأ الأساسي للإحصاء الكمومي وما هو دوره في تفسير التراكيب الإلكترونية للذرات والجزيئات؟",
        "OPI": ["مبدأ بولية", "مبدأ الاستبعاد", "مبدأ الانتقالية", "مبدأ الفلكي"],
        "CO": "مبدأ الاستبعاد"
    },
    {
        "question": "ما هو نظام CRISPR-Cas9 وكيف يمكن استخدامه في تحرير الجينات وتعديل الوراثة؟",
        "OPI": ["نظام تنقية المياه", "نظام مراقبة الطقس", "نظام الدفاع الجوي", "نظام التعديل الجيني"],
        "CO": "نظام التعديل الجيني"
    },
    {
        "question": "ما هي الظاهرة المعروفة باسم الاندماج النووي وما هو الوقود الأساسي للاندماج النووي في الشمس والنجوم؟",
        "OPI": ["انصهار النوى", "تحلل النوى", "تبديد النوى", "تكون النوى"],
        "CO": "انصهار النوى"
    },
    {
        "question": "ما هو البوزيون الحر وكيف يمكن استخدامه في تحقيق تبريد الذرات إلى درجات حرارة قريبة جداً من الصفر المطلق؟",
        "OPI": ["الإنتاج الحراري", "التحول الكهربائي", "الإشعاع الحر", "التبريد الحراري"],
        "CO": "التبريد الحراري"
    },
    {
        "question": "ما هو الخيط الزمني وما هو دوره في فهم طبيعة الزمكان والتأرجح الزمني؟",
        "OPI": ["البعد الزمكاني", "التباعد الزمكاني", "التصاعد الزمكاني", "الزمن الفضائي"],
        "CO": "البعد الزمكاني"
    },
    {
        "question": "ما هو أكبر بحر في العالم؟",
        "OPI": ["البحر الأحمر", "البحر المتوسط", "البحر الأسود", "بحر الصين الجنوبي"],
        "CO": "البحر الأسود"
    },
    {
        "question": "ما هو اسم العملة الرسمية في البرازيل؟",
        "OPI": ["البيزو البرازيلي", "الريال البرازيلي", "الدولار البرازيلي", "الفرنك البرازيلي"],
        "CO": "الريال البرازيلي"
    },
    {
        "question": "متى أُعلنت قوانين نيورنبيرغ؟",
        "OPI": ["في عام 1935", "في عام 1940", "في عام 1945", "في عام 1950"],
        "CO": "في عام 1935"
    },
    {
        "question": "متى انتهت الحرب العالمية الأولى؟",
        "OPI": ["في عام 1916", "في عام 1917", "في عام 1918", "في عام 1919"],
        "CO": "في عام 1918"
    },
    {
        "question": "ما هي تاريخ وقوع ثورة أكتوبر في روسيا؟",
        "OPI": ["في 7 أكتوبر 1917", "في 14 أكتوبر 1917", "في 7 نوفمبر 1917", "في 14 نوفمبر 1917"],
        "CO": "في 7 نوفمبر 1917"
    },
    {
        "question": "متى بدأت الحرب العالمية الثانية؟",
        "OPI": ["في عام 1935", "في عام 1938", "في عام 1939", "في عام 1941"],
        "CO": "في عام 1939"
    },
    {
        "question": "ما هو تاريخ اكتشاف الأمريكتين بواسطة كريستوفر كولومبوس؟",
        "OPI": ["12 أكتوبر 1492", "20 مايو 1498", "6 سبتمبر 1522", "28 نوفمبر 1510"],
        "CO": "12 أكتوبر 1492"
    },
    {
        "question": "متى وقعت ثورة فرنسا؟",
        "OPI": ["في عام 1776", "في عام 1789", "في عام 1804", "في عام 1812"],
        "CO": "في عام 1789"
    },
    {
        "question": "متى بنيت الأهرامات في مصر؟",
        "OPI": ["حوالي عام 2000 قبل الميلاد", "حوالي عام 1500 قبل الميلاد", "حوالي عام 1000 قبل الميلاد", "حوالي عام 500 قبل الميلاد"],
        "CO": "حوالي عام 2000 قبل الميلاد"
    },
    {
        "question": "من هو مؤسس شركة أمازون؟",
        "OPI": ["جيف بيزوس", "إيلون ماسك", "بيل غيتس", "مارك زوكربيرج"],
        "CO": "جيف بيزوس"
    },
    {
        "question": "ما هو أكبر مركز تجاري في دبي؟",
        "OPI": ["مول الإمارات", "مول البستكية", "مول دبي", "مول العرب"],
        "CO": "مول الإمارات"
    },
    {
        "question": "ما هي اللغة الرسمية لدولة البرازيل؟",
        "OPI": ["الإسبانية", "البرتغالية", "الفرنسية", "الإيطالية"],
        "CO": "البرتغالية"
    },
    {
        "question": "ما هو أكبر حيوان على الأرض من حيث الوزن؟",
        "OPI": ["الفيل الأفريقي", "الحوت الأزرق", "الزرافة", "النمر"],
        "CO": "الحوت الأزرق"
    },
    {
        "question": "ما هي عاصمة جمهورية كوريا؟",
        "OPI": ["سيئول", "طوكيو", "بكين", "هانوي"],
        "CO": "سيئول"
    },
    {
        "question": "ما هي أكثر الألوان جاذبية للبشر؟",
        "OPI": ["اللون الأحمر", "اللون الأزرق", "اللون الأصفر", "اللون الأخضر"],
        "CO": "اللون الأزرق"
    },
    {
        "question": "ما هي أول دولة في العالم أدخلت الطابع البريدي؟",
        "OPI": ["المملكة المتحدة", "الولايات المتحدة الأمريكية", "فرنسا", "الصين"],
        "CO": "المملكة المتحدة"
    },
    {
        "question": "ما هو أكبر سلسلة جبلية في العالم؟",
        "OPI": ["سلسلة جبال الألب", "سلسلة جبال الأنديز", "سلسلة جبال الروكي", "سلسلة جبال الهملايا"],
        "CO": "سلسلة جبال الهملايا"
    },
    {
        "question": "ما هو أكثر بحر مالحًا في العالم؟",
        "OPI": ["البحر المتوسط", "البحر الأحمر", "البحر الأسود", "بحر البلطيق"],
        "CO": "البحر المتوسط"
    },
    {
        "question": "ما هو اسم المخترع الذي اخترع المصباح الكهربائي؟",
        "OPI": ["توماس أديسون", "إيلون ماسك", "نيكولا تسلا", "بنجامين فرانكلين"],
        "CO": "توماس أديسون"
    },
    {
        "question": "ما هو أكبر حيوان طائر في العالم؟",
        "OPI": ["البطريق الإمبراطوري", "النسر الأمريكي", "النعامة", "الطاووس"],
        "CO": "الطاووس"
    },
    {
        "question": "ما هي عاصمة جمهورية ألمانيا الاتحادية؟",
        "OPI": ["برلين", "ميونخ", "هامبورغ", "فرانكفورت"],
        "CO": "برلين"
    },
    {
        "question": "ما هو اسم الملكة الحالية للمملكة المتحدة؟",
        "OPI": ["الملكة إليزابيث الثانية", "الملكة فيكتوريا", "الملكة ماري", "الملكة آن"],
        "CO": "الملكة إليزابيث الثانية"
    },
    {
        "question": "ما هو النجم الذي يشكل قسم الذيل في كوكبة الدب الأكبر؟",
        "OPI": ["الزهرة", "الشمس", "الدجاجة", "ألفا الدب الأكبر"],
        "CO": "ألفا الدب الأكبر"
    },
    {
        "question": "ما هو اسم أول إنسان قطع حول العالم؟",
        "OPI": ["فرديناند ماجلان", "كريستوفر كولومبوس", "جيمس كوك", "أميليا إيرهارت"],
        "CO": "فرديناند ماجلان"
    },
    {
        "question": "ما هو اسم أول إنسان قمر على سطح القمر؟",
        "OPI": ["بوز ألدرين", "نيل آرمسترونج", "يوري غاغارين", "جون غلين"],
        "CO": "نيل آرمسترونج"
    },
    {
        "question": "ما هي عاصمة الصين؟",
        "OPI": ["شنغهاي", "بكين", "هونغ كونغ", "ماكاو"],
        "CO": "بكين"
    },
    {
        "question": "في أي سنة وقع فتح مكة؟",
        "OPI": ["في عام 611 ميلادي", "في عام 624 ميلادي", "في عام 630 ميلادي", "في عام 638 ميلادي"],
        "CO": "في عام 630 ميلادي"
    },
    {
        "question": "متى وقعت غزوة بدر؟",
        "OPI": ["في عام 620 ميلادي", "في عام 624 ميلادي", "في عام 628 ميلادي", "في عام 630 ميلادي"],
        "CO": "في عام 624 ميلادي"
    },
    {
        "question": "متى وقعت غزوة الأحد؟",
        "OPI": ["في عام 622 ميلادي", "في عام 625 ميلادي", "في عام 626 ميلادي", "في عام 630 ميلادي"],
        "CO": "في عام 625 ميلادي"
    },
    {
        "question": "متى وقعت هجرة النبي محمد صلى الله عليه وسلم من مكة إلى المدينة؟",
        "OPI": ["في عام 610 ميلادي", "في عام 612 ميلادي", "في عام 622 ميلادي", "في عام 632 ميلادي"],
        "CO": "في عام 622 ميلادي"
    },
    {
        "question": "متى وقعت غزوة الخندق؟",
        "OPI": ["في عام 624 ميلادي", "في عام 625 ميلادي", "في عام 627 ميلادي", "في عام 628 ميلادي"],
        "CO": "في عام 627 ميلادي"
    },
    {
        "question": "متى وقعت غزوة مؤتة؟",
        "OPI": ["في عام 625 ميلادي", "في عام 627 ميلادي", "في عام 629 ميلادي", "في عام 630 ميلادي"],
        "CO": "في عام 629 ميلادي"
    },
    {
        "question": "متى وقعت غزوة تبوك؟",
        "OPI": ["في عام 625 ميلادي", "في عام 627 ميلادي", "في عام 630 ميلادي", "في عام 632 ميلادي"],
        "CO": "في عام 630 ميلادي"
    },
    {
        "question": "متى وقعت فتح مصر؟",
        "OPI": ["في عام 621 ميلادي", "في عام 642 ميلادي", "في عام 650 ميلادي", "في عام 654 ميلادي"],
        "CO": "في عام 642 ميلادي"
    },
    {
        "question": "متى وقعت غزوة القادسية؟",
        "OPI": ["في عام 622 ميلادي", "في عام 632 ميلادي", "في عام 636 ميلادي", "في عام 637 ميلادي"],
        "CO": "في عام 637 ميلادي"
    },
    {
        "question": "متى وقعت غزوة الأندلس؟",
        "OPI": ["في عام 711 ميلادي", "في عام 721 ميلادي", "في عام 732 ميلادي", "في عام 750 ميلادي"],
        "CO": "في عام 711 ميلادي"
    },
    {
        "question": "متى وقعت ثورة أكتوبر الروسية؟",
        "OPI": ["في عام 1917", "في عام 1920", "في عام 1923", "في عام 1925"],
        "CO": "في عام 1917"
    },
    {
        "question": "ما هي تاريخ وقوع ثورة مايو في فرنسا؟",
        "OPI": ["5 مايو 1789", "14 مايو 1789", "5 مايو 1798", "14 مايو 1798"],
        "CO": "5 مايو 1789"
    },
    {
        "question": "متى انتهت الحرب العالمية الثانية في أوروبا؟",
        "OPI": ["8 مايو 1945", "9 مايو 1945", "10 مايو 1945", "11 مايو 1945"],
        "CO": "8 مايو 1945"
    },
    {
        "question": "كم عدد أصحاب الكهف؟",
        "OPI": ["7", "3", "5", "9"],
        "CO": "7"
    },
    {
        "question": "ما هي الفترة التي قضوها اصحاب الكهف في الكهف بحسب القرآن الكريم؟",
        "OPI": ["ثلاثة أيام", "ثلاثة أشهر", "ثلاثمائة سنة وتسعة", "تسع سنوات"],
        "CO": "ثلاثمائة سنة وتسعة"
    },
    {
        "question": "ماذا سمي الشاب الذي آمن بقصة أصحاب الكهف عندما وجدهم؟",
        "OPI": ["صفوان", "صاحب الكهف", "صاحب الرقيم", "أسد"],
        "CO": "صفوان"
    },
    {
        "question": "ما هي السورة التي وردت فيها قصة أصحاب الكهف بالتفصيل في القرآن الكريم؟",
        "OPI": ["سورة النحل", "سورة الكهف", "سورة يونس", "سورة البقرة"],
        "CO": "سورة الكهف"
    },
    {
        "question": "ما هو اسم الجسيم الذي تم اكتشافه في مسرع الهادرونات بمركز سيرن؟",
        "OPI": ["البروتون", "النيوترون", "البوزون هيغز", "الكوارك"],
        "CO": "البوزون هيغز"
    },
    {
        "question": "ما هو اسم النظرية التي تصف الجاذبية باعتبارها انحناءً للزمكان الأربعة؟",
        "OPI": ["نظرية النسبية العامة", "الميكانيكا الكمية", "نظرية المجال الكهرومغناطيسي", "نظرية الكم النسبي"],
        "CO": "نظرية النسبية العامة"
    },
    {
        "question": "ما هو اسم المشروع الذي يهدف إلى تسريع البروتونات والأيونات الثقيلة لتوليد تصادمات متناهية الطاقة؟",
        "OPI": ["مشروع هادرون", "مشروع فضاء مشترك", "مشروع طاقة المستقبل", "المشروع الكبير"],
        "CO": "مشروع هادرون"
    },
    {
        "question": "ما هو اسم الجسيم الذي يعتبر بديلاً عن الفوتون ويتوقع أنه ينقل الجاذبية؟",
        "OPI": ["الغلون", "الجاوزون", "الجرافيتون", "الغرافيتون"],
        "CO": "الغرافيتون"
    },
    {
        "question": "ما هو اسم الظاهرة التي تسمح للجسيمات الكهرومغناطيسية بكسب كتلة عند تفاعلها مع حقل هيغز؟",
        "OPI": ["التأرجح الجماعي", "التأرجح الكهروضوئي", "الاندماج النووي", "آلية هيغز"],
        "CO": "آلية هيغز"
    },
    {
        "question": "ما هو اسم الظاهرة التي تسمح للجسيمات الكهروضعيفة بكسب كتلة عند تفاعلها مع حقل هيغز؟",
        "OPI": ["التأرجح الكهروضوئي", "التأرجح الجماعي", "التأرجح الكهروضعيف", "آلية هيغز"],
        "CO": "التأرجح الكهروضعيف"
    },
    {
        "question": "ما هو اسم الظاهرة التي تمنع الجسيمات النووية المشحونة من التقارب لأقرب نقطة؟",
        "OPI": ["الدفع الكهرومغناطيسي", "الحقل الكهرومغناطيسي", "الاندماج النووي", "الحاجز النووي"],
        "CO": "الحاجز النووي"
    },
    {
        "question": "ما هو اسم النظرية التي تجمع بين النسبية العامة والميكانيكا الكمية؟",
        "OPI": ["النسبية الميكانيكية", "النسبية الكمية", "النظرية النانوية", "النسبية النووية"],
        "CO": "النسبية الميكانيكية"
    },
    {
        "question": "ما هو اسم الجسيم الذي يمثل نقطة البداية في الانفجار العظيم ويعتبر بداية الكون؟",
        "OPI": ["الكوارك", "البوزون هيغز", "البوزون الحوامل", "النيوترينو"],
        "CO": "البوزون هيغز"
    },
    {
        "question": "ما هو اسم العنصر الأساسي الذي يُشكل جسيمات كل من البروتون والنيوترون؟",
        "OPI": ["الكوارك", "الليبتون", "الفوتون", "البوزون"],
        "CO": "الكوارك"
    }
]

users = {}

@bot.message_handler(commands=['go'])
def start(message):
    id = message.chat.id
    name = message.chat.first_name
    users.setdefault(id, {'score': 0, 'current_QQ': None})

    if users[id]['score'] >= 10000:
        users[id]['score'] = 0
        bot.send_message(id, "إجابة صحيحة و فزت بلعبة وحصلت على ( 10000 ) ، وتم تصفير رصيدك")
        return

    QQ = random.choice(QQs)
    users[id]['current_QQ'] = QQ

    OPI = QQ['OPI']
    random.shuffle(OPI)
    user = users[id]
    btn = InlineKeyboardMarkup(row_width=2)
    btn1 = InlineKeyboardButton(f"رصيدك : {user['score']}", callback_data="score")
    btn4 = [InlineKeyboardButton(option, callback_data=option) for option in OPI]
    btn.add(*btn4)
    btn.add(btn1)

    bot.send_message(id, QQ['question'], reply_markup=btn)


@bot.callback_query_handler(func=lambda call: True)
def dudrd(call):
    id = call.from_user.id
    name = call.from_user.first_name
    mssg = call.message.message_id

    user = users[id]
    QQ = user['current_QQ']
    CO = QQ['CO']
    OP = call.data

    if OP == CO:
        user['score'] += 100
        if user['score'] >= 10000:
            user['score'] = 0
            bot.edit_message_text(f"إجابة صحيحة و فزت بلعبة وحصلت على ( 10000 ) ، وتم تصفير رصيدك", chat_id=id, message_id=mssg)
        else:
            bot.edit_message_text(f"إجابة صحيحة , اضفت لك 100 نقطة \n رصيدك هسه : {user['score']}", chat_id=id, message_id=mssg)
    elif OP == "score":
        bot.answer_callback_query(call.id, text=f"{user['score']}")
        return
    else:
        user['score'] = 0
        bot.edit_message_text(f"أجابة خطأ تم تصفير رصيدك الى ( 0 ) ", chat_id=id, message_id=mssg)

    start(call.message)
  



print('تم تشغيل البوت بنجاح ✅😜')
bot.infinity_polling()